import random
import time
dice_odds = {
1 :
        ("┌─────────┐"
        ,"│         │"
        ,"│    ●    │"
        ,"│         │"
        ,"└─────────┘"),
2 :
        ("┌─────────┐"
        ,"│  ●      │"
        ,"│         │"
        ,"│      ●  │"
        ,"└─────────┘"),
3 :
        ("┌─────────┐"
        ,"│  ●      │"
        ,"│    ●    │"
        ,"│      ●  │"
        ,"└─────────┘"),
4 :
        ("┌─────────┐"
        ,"│  ●   ●  │"
        ,"│         │"
        ,"│  ●   ●  │"
        ,"└─────────┘") ,
5 :
        ("┌─────────┐"
        ,"│ ●     ● │"
        ,"│    ●    │"
        ,"│ ●     ● │"
        ,"└─────────┘") ,
6 :
        ("┌─────────┐"
        ,"│  ●   ●  │"
        ,"│  ●   ●  │"
        ,"│  ●   ●  │"
        ,"└─────────┘")
}
dealer_quotes_arabic = (
    "سمّي وارمي يا وحش، الرزق على الله",
    "وسع السكة عشان الزهر نازل يرن",
    "الزهر لغة، ميفهمهاش غير المعلمين.",
    "يلا يا باشا، ورّينا بياضك",
    "الزهر ده مالوش كبير يا ريس.",
    "سيب الزهر يلعب ويقول كلمته",
    "الزهر يحب الجرئ، خش بقلب جامد",
    "غمض عينك وارمي، والباقي مش بتاعك",
    "يا مسهل الحال يا رب..",
    "الزهر دوّار، يا عالم هيرسى على إيه",
    "متحسبهاش، ارميها وهي هتتعدل لوحدها",
    "الزهر ما بيتعاندش، الزهر عايز مسايسة",
    "يا صابت يا خابت، ارمي واتكل",
    "اديها واحدة نو ريسك نو فن"
    "شخلل وسمّعنا الرنة يا كبير",
    "اللي ملوش قلب.. ملوش رزق",
    "كله على عينك يا تاجر، ورّينا",
    "الزهر مبيحبش الأيد المرتعشة",
    "الحظ لما يواتي.. يخلي الأعمى ساعاتي",
    "الزهر مجنون.. وعايز عاقل يروضه",
    "اللي يخاف من العفريت.. مايلعبش معاه",
    "ارميها وهي ترسى على بر",
    "الزهر ملوش أمان",
    "بحري ولا قبلي، ارمي وشوف رزقك",
    "ماتسرحش بخيالك، الزهر في انتظارك",
    "صاحب الزهر ولا تعاندوش",
    "يا تجيبنا في العالي.. يا تودينّا في داهية",
)
print("-------------------Dice Roller🎲-------------------")
is_running = True
while is_running:
    button = input("How many dices do you like?(q to quit):")
    if button.lower() == "q":
        is_running = False
    else:
        print(random.choice(dealer_quotes_arabic))
        deal = []
        for _ in range(int(button)):
            deal.append(random.randint(1, 6))
        for index in range(5):
            for odd in deal:
                print(dice_odds[odd][index], end=" ")
            print()
            time.sleep(0.5)

